-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Июн 04 2020 г., 03:21
-- Версия сервера: 8.0.20-0ubuntu0.20.04.1
-- Версия PHP: 7.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test`
--
CREATE DATABASE IF NOT EXISTS `test` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `test`;

-- --------------------------------------------------------

--
-- Структура таблицы `currency`
--

CREATE TABLE `currency` (
  `id` int NOT NULL,
  `date` date NOT NULL,
  `valute` varchar(100) NOT NULL,
  `value` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `currency`
--

INSERT INTO `currency` (`id`, `date`, `valute`, `value`) VALUES
(363, '2020-05-01', 'USD', 72.7263),
(364, '2020-05-01', 'EUR', 79.1189),
(365, '2020-05-01', 'CNY', 10.313),
(366, '2020-05-01', 'JPY', 0.682),
(367, '2020-05-07', 'USD', 73.9719),
(368, '2020-05-07', 'EUR', 80.0598),
(369, '2020-05-07', 'CNY', 10.4265),
(370, '2020-05-07', 'JPY', 0.6953),
(371, '2020-05-08', 'USD', 74.1169),
(372, '2020-05-08', 'EUR', 80.0611),
(373, '2020-05-08', 'CNY', 10.4508),
(374, '2020-05-08', 'JPY', 0.6966),
(375, '2020-05-09', 'USD', 73.8725),
(376, '2020-05-09', 'EUR', 80.0039),
(377, '2020-05-09', 'CNY', 10.4346),
(378, '2020-05-09', 'JPY', 0.6948),
(379, '2020-05-13', 'USD', 73.4326),
(380, '2020-05-13', 'EUR', 79.4394),
(381, '2020-05-13', 'CNY', 10.3576),
(382, '2020-05-13', 'JPY', 0.6831),
(383, '2020-05-14', 'USD', 73.5819),
(384, '2020-05-14', 'EUR', 79.7775),
(385, '2020-05-14', 'CNY', 10.372),
(386, '2020-05-14', 'JPY', 0.6876),
(387, '2020-05-15', 'USD', 73.9298),
(388, '2020-05-15', 'EUR', 79.9033),
(389, '2020-05-15', 'CNY', 10.4206),
(390, '2020-05-15', 'JPY', 0.6919),
(391, '2020-05-16', 'USD', 73.2056),
(392, '2020-05-16', 'EUR', 79.1279),
(393, '2020-05-16', 'CNY', 10.3108),
(394, '2020-05-16', 'JPY', 0.6838),
(395, '2020-05-19', 'USD', 72.9798),
(396, '2020-05-19', 'EUR', 78.9422),
(397, '2020-05-19', 'CNY', 10.2583),
(398, '2020-05-19', 'JPY', 0.6805),
(399, '2020-05-20', 'USD', 72.3918),
(400, '2020-05-20', 'EUR', 79.1677),
(401, '2020-05-20', 'CNY', 10.1857),
(402, '2020-05-20', 'JPY', 0.6742),
(403, '2020-05-21', 'USD', 72.3381),
(404, '2020-05-21', 'EUR', 79.1813),
(405, '2020-05-21', 'CNY', 10.1791),
(406, '2020-05-21', 'JPY', 0.6717),
(407, '2020-05-22', 'USD', 70.924),
(408, '2020-05-22', 'EUR', 77.7965),
(409, '2020-05-22', 'CNY', 9.9892),
(410, '2020-05-22', 'JPY', 0.6584),
(411, '2020-05-23', 'USD', 71.8804),
(412, '2020-05-23', 'EUR', 78.4431),
(413, '2020-05-23', 'CNY', 10.0636),
(414, '2020-05-23', 'JPY', 0.6687),
(415, '2020-05-26', 'USD', 71.5962),
(416, '2020-05-26', 'EUR', 77.8823),
(417, '2020-05-26', 'CNY', 10.028),
(418, '2020-05-26', 'JPY', 0.6645),
(419, '2020-05-27', 'USD', 71.1408),
(420, '2020-05-27', 'EUR', 77.7854),
(421, '2020-05-27', 'CNY', 9.9694),
(422, '2020-05-27', 'JPY', 0.6599),
(423, '2020-05-28', 'USD', 71.0635),
(424, '2020-05-28', 'EUR', 77.9069),
(425, '2020-05-28', 'CNY', 9.9331),
(426, '2020-05-28', 'JPY', 0.6608),
(427, '2020-05-29', 'USD', 71.1012),
(428, '2020-05-29', 'EUR', 78.2611),
(429, '2020-05-29', 'CNY', 9.9309),
(430, '2020-05-29', 'JPY', 0.6594),
(431, '2020-05-30', 'USD', 70.752),
(432, '2020-05-30', 'EUR', 78.5489),
(433, '2020-05-30', 'CNY', 9.9008),
(434, '2020-05-30', 'JPY', 0.6595);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `currency`
--
ALTER TABLE `currency`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `currency`
--
ALTER TABLE `currency`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=435;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
